{
    "Country": "Austria Visa - Schengen ",
    "Official_Name": "Austria Visa - Schengen",
    "Country_Description": "<b>Austria</b>  officially the Republic of Austria, is a landlocked East Alpine country in the southern part of Central Europe. It is composed of nine federated states, one of which is Vienna, Austria's capital and largest city. Austria is famous for its castles, palaces and buildings, among other architectural works.",
    "Required_Documents": [
        "The passport must be valid for at least six months after your intended departure from Schengen States",
        "UAE residence visa should be valid for 03 months from the date of return from Schengen",
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "Original personal bank account statement for the last six months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "Sponsored family members have to enclose a copy of original birth and marriage certificate"
      ],
    "Supporting_Documents": {
        "For Tourism": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance that covers the whole territory of all Schengen member states and has a minimum coverage of € 30.000"
          ],
        "For Visiting family and/or friends": [
            "Invitation letter signed by the host",
            "Copy of host’s passport",
            "Host’s Residence Permit",
            "EVE or GVE - electronic liability declaration, these are the only accepted forms of liability declarations"
          ],
        "For Business/  Conference or Training for a Company":[
            "Letter of invitation from the Austrian company you will be visiting, with their complete address and the dates of your visit",
            "Proof of trip funding – for the applicant's costs while in Austria"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
      
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
     ]
}