{
    "Country": "Belgium Visa - Schengen",
    "Official_Name": "Belgium Visa - Schengen",
    "Country_Description": "<p><b>Belgium,</b> a country in Western Europe, is known for medieval towns, Renaissance architecture and as headquarters of the European Union and NATO. The country has distinctive regions including Dutch-speaking Flanders to the north, French-speaking Wallonia to the south and a German-speaking community to the east. The bilingual capital, Brussels, has ornate guildhalls at Grand-Place and elegant art-nouveau buildings.</p><p><br>Different parts of today’s Belgium have been ruled by the Dutch, Spanish, French, Austrian, which have left behind a rich history and architecture. The country is distinguished by its canals, cobbled streets and medieval buildings.</p>",
    "Required_Documents": [
        "The passport must be valid for at least six months after your intended departure from Schengen States",
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "UAE residence visa should be valid for 03 months from the date of return from Schengen",
        "Original personal bank account statement for the last three months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "Sponsored family members (spouses, students etc) have to enclose a copy of original birth and marriage certificate"
      ],
    "Supporting_Documents": {
        "": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance that covers the whole territory of all Schengen member states and has a minimum coverage of € 30.000",
            "A detailed daily program of your stay taking into consideration that if the applicant is travelling to Belgium and/or more than one Schengen country"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}