{
    "Country": "Brazil Visa",
    "Official_Name": "Brazil Visa",
    "Country_Description": "<p><b>Brazil</b> is the largest country in South America bounded by the Atlantic Ocean. The Amazon River runs through northeastern Brazil, and the Amazon Rainforest covers about one-third of the country.</p>",
    "Additional_Description": "<br><h5>How to Apply for a Visa to the Brazil from Dubai and Abu Dhabi</h5><p>Planning to visit Brazil, the football passionate country with amazing man-made constructions like Itaipu Dam, Christ the Redeemer, etc. Plan your trip to Brazil with finewayra Travel and apply for a tourist visa to Brazil from us without hassle.</p><p>Visitor visas may be granted to visitors for a short stay, for the following purposes:</p><ul class='feature-list'><li>Tourism</li><li>   Business</li><li> Transit </li></ul><br><h5>Some passport holders need to apply in person</h5><p>Applicants holding Afghan, Egyptian, Eritrean, Ethiopian, Iranian, Iraqi, Jordanian, Lebanese, Libyan, Nepalese, Nigerian, North Korean, Pakistani, Palestinian, Senegalese, Sudanese or Syrian passports are required to apply in person.</p><br><h5>Processing Time</h5><p>Visas are issued in a minimum of 5 – 7 working days</p>",
    "Required_Documents": [
        "One (1) recent photo 3x4 cm, front view, white background",
        "The applicant’s passport, valid for no less than 6 months, with at least two blank pages",
        "The applicant's UAE original residence visa, with a copy. Applicants that are not residents of the UAE must apply in person;",
        "Applicant’s personal bank statement stamped by the bank for the last three (3) months",
        "NOC Letter from the sponsor (stating the applicant’s position in the company, wage and purpose of the trip)",
        "A legible copy (deposit slip) of the consular fee payment"
      ],
    "Supporting_Documents": {
        "": [
            "Hotel booking reservation/s confirming duration of stay",
            "Travel itinerary such as airline bookings/tickets showing departure dates and destinations",
            "Travel & medical insurance"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}