{
    "Country": "France Visa - Schengen",
    "Official_Name": "France Visa - Schengen",
    "Country_Description": "<p><b>France,</b>  the most visited country in Europe, contains historic cities, mountain villages, and Mediterranean beaches throughout Western Europe. Paris, its capital, is known for its fashion houses, classical art museums such as the Louvre, and landmarks such as the Eiffel Tower. Wines and exquisite cuisine are also well-known in the country. Lascaux's prehistoric cave drawings, Lyon's Roman Theater, and Versailles' immense Palace witness to this.</p><br><p>France the western European country where everyone wanted to visit once in a lifetime and it’s a tourist destination for honeymooners, family, and children. The country is famous for Eiffel Tower, Mediterranean beaches, Disneyland and so on. France is surrounded by Bay of Biscay in west, the English Channel in North West, North Sea in north and east and south by neighboring European countries.</p>",
    "Additional_Description": "<br><h5>How to Apply for France Visa from UAE (Dubai & Abu Dhabi)</h5><p>If you are planning to visit France as tourist or for the purpose of business, you might be required a pre-arranged visa prior to the arrival at any France borders. If you are a UAE resident, read below information before you start your visa application..</p><p>France Visa requirements and application procedure to apply from Dubai & Abu Dhabi - Please note applications are accepted only through prior appointments. Appointments for submitting documents to the appropriate visa application center can be made through fineway Travel.</p>",
    "Required_Documents": [
        "The passport must be valid a minimum of six months after your intended departure from the territory of the Schengen States",
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "UAE residence permit must be valid for three months after the departure from the Schengen area",
        "Original personal bank account statement for the six months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "In case of dependents - copy of sponsor’s valid passport and UAE residence visa to be attached to letter from sponsor",
        "Sponsored family members (spouses, students etc.) have to enclose a copy of original birth and marriage certificate"
      ],
    "Supporting_Documents": {
        "": [
            "Reservation confirmation of an organized trip or any other document describing the planned program",
            "Reservation of a return ticket or travel itinerary",
            "Travel health insurance certificate",
            "Reservation of a hotel or proof of accommodation"
          ]
       
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}