{
    "Country": "Greece Visa - Schengen",
    "Official_Name": "Greece Visa - Schengen",
    "Country_Description": "<p><b>Greece</b> is a country in southeastern Europe with thousands of islands throughout the Aegean and Ionian seas. Influential in ancient times, it's often called the cradle of Western civilization. Athens, its capital, retains landmarks including the 5th-century B.C. Acropolis citadel with the Parthenon temple. Greece is also known for its beaches, from the black sands of Santorini to the party resorts of Mykonos.</p><br><p><b>How to apply for Greece Visa (Schengen) from Dubai</b></p><p>Are you planning to visit Greece, the European ancient country for vacation or business? You may require a pre-arranged visa before arriving into the country. If you are new to visa applications / not applied any Schengen Visa before you can contact fineway Travel for all your visa assistance including documentation, travel itinerary preparation, travel insurance etc.</p>",
    "Required_Documents": [
        "The passport must be valid a minimum of six months after your intended departure from the territory of the Schengen States",
        "UAE residence permit must be valid for three months after the departure from the Schengen area",
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "Original personal bank account statement for the last three months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "In case of dependents - copy of sponsor’s valid passport and UAE residence visa to be attached to letter from sponsor"
      ],
    "Supporting_Documents": {
        "For Tourism": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc.)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance covering the entire territory of all Schengen member states with a minimum coverage of € 30.000",
            "Full travel itinerary",
            "Sponsored family members (spouses, students etc.) have to enclose a copy of original birth and marriage certificate including an English translation"
          ],
        "For Business": [
            "Invitation letter from a company or an authority to attend a meeting, conference or event or other documents which shows the existence of trade relations or relations for work purposes "
        ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}