{
    "Country": "Hungary Visa ",
    "Official_Name": "Hungary Visa - Schengen",
    "Country_Description": "<b>Hungary</b> is a landlocked country in Central Europe. Its capital, Budapest, is bisected by the Danube River. It shares land borders with Slovakia in the north, Ukraine in the northeast, Austria in the northwest, Romania in the east, Serbia in the south, Croatia in the southwest, and Slovenia in the west.",
    "Required_Documents": [
        "Your passport valid for at least 6 months beyond return date are required. Your passport must have at least two blank pages",
        "Recent color passport photograph (35–45mm in width), no more than 6-months old",
        "UAE residence permit must be valid for three months after the departure from the Schengen area",
        "Original personal bank account statement for the last six months signed and stamped by the bank",
        "NOC Letter from the company should be mentioned designation, date of joining, salary paid, the purpose of visit and financial arrangements"
    ],
    "Supporting_Documents": {
        "For Tourism": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc.)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance covering the entire territory of all Schengen member states with a minimum coverage of € 30.000",
            "In case of dependents- copy of sponsor’s valid passport and UAE residence visa to be attached to letter from sponsor",
            "Sponsored family members (spouses, students etc.) have to enclose a copy of original birth and marriage certificate including an English translation"
        ],
        "For Visiting family and/or friends": [
            "Invitation letter signed by the host",
            "Copy of host’s passport",
            "Host’s Residence Permit"
        ],
        "For Business/ Official":[
            "Invitation letter from the company or business partner in Hungary"
        ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
      
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
     ]
}