{
    "Country": "Serbia Visa",
    "Official_Name": "Serbia Visa",
    "Country_Description": "<b>Serbia</b> is a landlocked country located at the crossroads of Central and Southeastern Europe, covering the central part of the Balkans. Serbia has a mixed economic system in which the presence of the state in the economy is considerable, but there is limited private sector freedom.",
    "Required_Documents": [
        "Your passport valid for at least 6 months beyond return date are required. Your passport must have at least two blank pages",
        "Recent color passport photograph (35–45mm in width), no more than 6-months old",
        "Copy of UAE Residence Visa valid at least 90 days from the intended return date",
        "Bank statements for the past three months or other verifiable evidence of sufficient means of subsistence during intended stay",
        "NOC letter from the employer; stating the salary, applicant's current position/work and date when joining the company, the dates of the approved leave, and purpose of the visit"
      ],
    "Supporting_Documents": {
        "For Tourism": [
            "Copy of a round trip ticket or itinerary",
            "Proof of accommodation",
            "Travel insurance",
            "Voucher of the travel agency stating that the trip has been paid in full"
          ],
       "For Business": [
        "Letter from the employer stating the purpose of the trip to Serbia",
        "Invitation Letter of by a company in Serbia",
        "Invitation Letter certified by the relevant authority of the Republic of Serbia"
      ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}