{
    "Country": "South Korea Visa",
    "Official_Name": "South Korea Visa",
    "Country_Description": "<b>South Korea</b> is a country in Eastern Asia occupying the southern half of the Korean Peninsula. It borders the Sea of Japan, the Yellow Sea, and North Korea.   It is equally known for its green, hilly countryside dotted with cherry trees and centuries-old Buddhist temples, plus its coastal fishing villages, sub-tropical islands and high-tech cities such as Seoul, the capital.",
    "Additional_Description": "<br><h5>How to Apply South Korea Visa from UAE</h5><p>You can apply visa to South Korea for Tourism, Business and Medical treatment from the United Arab Emirates. If you are residing in Abu Dhabi or Alain and your visa is from Abu Dhabi or Alain you must apply from South Korea embassy at Abu Dhabi. All other Dubai and northern emirates resident visa hold must apply from South Korea Dubai consulate.</p><p>Applying for South Korea visa is very simple, but if the visa got rejected once you can apply next after 06 month time only. So we recommend you to make sure the visa documents and application are 100% perfect, else you better contact a professional visa consultant to complete the same.</p><br><h5>How to apply South Korea Tourist or Business Visa from Dubai & Abu Dhabi</h5><p>If you are planning to visit South Korea as tourist, please note UAE residence visa holders with below 6 months remaining on their visa validity cannot apply through the Dubai Consulate & Embassy in Abu Dhabi. Please apply from your home country. So make sure the residence visa must have minimum 06 month validity.</p> <br><h5>Processing Time and Application Submission</h5><p>Visa issuance generally takes about 4 - 7 working days from the day of submission. However, for such cases in which required documents are omitted, submission of additional documents is requested, or an investigation is required, evaluation might take longer than usual.</p><p>Visa Application Time: 09:00-12:30, Sunday - Thursday (Applicant must be present before 12:00 noon to submit an application)</p>",
    "Required_Documents": [
        "The passport must be valid for at least six months after your intended departure from Schengen States",
        "UAE residence visa should be valid for 03 months from the date of return from Schengen",
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "Original personal bank account statement for the last six months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "Sponsored family members have to enclose a copy of original birth and marriage certificate"
    ],
    "Supporting_Documents": {
        "Tourism": [
            "Hotel reservation or proof of other accommodation",
            "Proof of flight ticket booking or flight reservation including return",
            "Proof of valid travel or international health insurance",
            "Employment Labor Contract / agreement"
        ],
        "For Business": [
            "Previous UAE visa – You must stay in the UAE for more than two years and hold a UAE residence visa issued by the UAE government",
            "Original and Notarized Invitation Letter – Must be notarized or attested by a notary or a lawyer within the Republic of Korea",
            "Original and Notarized Guarantee Letter - Must be notarized or attested by a notary or a lawyer within the Republic of Korea",
            "Certificate of Business Registration – Issuance date should be within 3 months from the application date"
        ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Submission of additional documents may be requested, after the application is completed",
        "The visa issuance may be denied after the screening of the application. Having all of the required documents does not guarantee a visa",
        "Visa Fee : 160 AED(Single-entry), 280 AED(Double-entry), 360 AED(Multiple-entry)",
        "Visa fees may change according to the nationality of the applicant",
        "Visa fee is not refundable even if visa is denied",
        "Application should be submitted in person"
    ]
}