{
    "Country": "Turkey Visa",
    "Official_Name": "Turkey Visa",
    "Country_Description": "<p><b>Turkey</b> is a transcontinental country located in Southeastern Europe and Southwestern Asia bordering the Black Sea. Neighboring countries include Armenia, Azerbaijan, Bulgaria, Georgia, Greece, Iran, Iraq, and Syria. Turkey has a strategic location controlling the <b>Turkish</b> Straits that link the Black and Aegean Seas.</p><p>Turkey is famous for its incredible wonders like Capadoccia or the Pamukkale cotton castle, for their kebabs and tasty food, for its incredible bazaars, and of course, another of the things Turkey is known for is its geographical location.</p>",
    "Required_Documents": [
        "The original of the passport which is at least valid for 6 months starting by the arrival date in Turkey and has at least two empty pages",
        "2 biometric photographs, a size of 5X6CM, with white background, shot in the last 6 months",
        "In order to apply in United Arab Emirates, starting from the date of application, applicant must have a valid resident permit for at least 6 months",
        "NOC letter from the company must indicate the position of the applicant, start date of employment, the dates that have vacation approved from work",
        "Personal bank account summary for the last 3 months, must be original signed and stamped"
    ],
    "Supporting_Documents": {
        "Tourism": [
            "Round trip flight pre-reservation",
            "Proof of accommodation",
            "Travel Health Insurance valid for the duration of the visa",
            "If any tenancy contract or title deed in UAE"
        ],
        "For Business": [
            "Invitation Letter from the inviting company in Turkey "
        ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}