{
    "Country": "UK Visa – United Kingdom",
    "Official_Name": "UK Visa – United Kingdom",
    "Country_Description": "<p>The United Kingdom, made up of England, Scotland, Wales and Northern Ireland, is an island nation in northwestern Europe. England – birthplace of Shakespeare and The Beatles – is home to the capital, London, a globally influential center of finance and culture. England is also site of Neolithic Stonehenge, Bath’s Roman spa and centuries-old universities at Oxford and Cambridge.</p>",
    "Additional_Description": "<br><h5>How to Apply for a Visa to the UK from Dubai and Abu Dhabi</h5><p>The United Kingdom is amongst the most frequently visited destinations for travelers in the world. In order to make your UK visa application process hassle-free and convenient, visa experts at finewayra Travel can help you an end-to-end assistance while submitting your documents at any of our branch.</p><br><h5>Types of UK visit visa available according to your purpose of visit</h5><p>Each visa type requires different documentation:</p><ul class='feature-list'><li>Tourism</li><li>   Business</li><li> Transit </li></ul><br>Cost of visa may vary according the visa type you select, if you are not sure about the type of visa you required, contact us with your requirement and we will help you to complete your application.</p>",
    "Required_Documents": [
        "One (1) recent photo 3x4 cm, front view, white background",
        "The applicant’s passport, valid for no less than 6 months, with at least two blank pages",
        "The applicant's UAE original residence visa valid for 3 months or more",
        "Applicant’s personal bank statement stamped by the bank for the last 06 months",
        "NOC from the company (should be mentioned designation, date of joining & salary paid)"
      ],
    "Supporting_Documents": {
        "": [
            "Documents showing that you own property or land, such as Property deed / mortgage statements/ accountant's letters / land registration",
            "Original and copy of marriage certificate with English translation",
            "Copy of birth certificate with English translation (Children less than 12 years old)"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}