{
    "Country": "USA Visa - United States of America",
    "Official_Name": "USA Visa - United States of America",
    "Country_Description": "<p>The United States is a country located in North America bordering the Atlantic Ocean and Pacific Ocean. Neighboring countries are Canada and Mexico. The geography of the United States is varied with mountains in the west, a broad central plain, and low mountains in the east.</p>",
    "Additional_Description": "<br><h5>How to Apply for a Visa to the United States from Dubai and Abu Dhabi</h5><p>United States of America welcomes all as a tourist or to visit your friends and families with a visa category B1/B2. In order to apply for US tourist visa from Dubai and Abu Dhabi in United Arab Emirates (UAE) you required some important documents mentioned below;</p>",
    "Required_Documents": [
        "The passport must be valid for at least six months beyond the period of stay in the United States",
        "Passport containing the most recently issued U.S. visa (if applicable)",
        "One 5 x 5 cm (2 x 2 inches) color photo taken within the last 6 months",
        "Nonimmigrant confirmation page",
        "Confirmation and Instructions page",
        "Accompanying family members, unless entering the United States for another purpose, should present a marriage certificate (spouse) and/or birth certificate (for unmarried children under 21), as applicable"
      ],
    "Supporting_Documents": {
        "": [
            "A copy of your current and valid UAE residency visa or Emirati national ID card",
            "Original letter from employer stating the applicant’s employment status, position, length of contract and salary",
            "An attested copy of your bank statement (6 months)",
            "Trade license if you are an Owner/Investor",
            "Evidence of educational qualifications obtained",
            "The purpose of your trip",
            "Your intent to depart the United States after your trip; and/or",
            "Your ability to pay all the costs of your trip",
            "Evidence of your employment and/or family ties may be sufficient to show the purpose of your trip and your intent to return to your home country",
            "If you cannot cover all the costs for your trip, you may show evidence that another person will cover some or all of the costs for your trip"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}