{
    "Country": "Bosnia and Herzegovina Visa",
    "Official_Name": "Bosnia and Herzegovina Visa",
    "Country_Description": "<p><b>Bosnia and Herzegovina</b>is a country in Southeastern Europe on the Balkan Peninsula. It borders Croatia, Serbia, and Montenegro and has a small Adriatic Sea coastline. The geography of Bosnia and Herzegovina is mountainous. The country's name comes from the two regions Bosnia and Herzegovina, which have a very vaguely defined border between them. Bosnia occupies the northern areas which are roughly four fifths of the entire country, while Herzegovina occupies the rest in the south part of the country.</p>",
    "Additional_Description": "<br><h5>How to Apply for a Visa to the Bosnia & Herzegovina from Dubai & Abu Dhabi</h5><p>The Embassy of Bosnia & Herzegovina in Abu Dhabi has consular responsibility for the United Arab Emirates and the Kingdom of Bahrain. Citizens of the United Arab Emirates and the Kingdom of Bahrain are exempted from the visa requirements when entering, exiting or traveling through Bosnia and Herzegovina for up to 90 days.</p><p>Foreigners who have multiple Schengen visa or European Union member state visa or residence permit of the Schengen Agreement country or European Union member state, or USA Visa can travel from the UAE and the Kingdom of Bahrain to Bosnia and Herzegovina and stay up to 30 days.</p>",
    "Required_Documents": [
        "A valid passport of the applicant",
        "Application form (completed and signed)",
        "Copy of a valid UAE / Bahrain residence visa",
        "One passport size picture",
        "Copy of your bank statement for the last 3 months",
        "No objection letter from your company or your sponsor"
      ],
    "Supporting_Documents": {
        "For Tourism": [
            "Copy of a round trip ticket or itinerary",
            "Proof of accommodation",
            "Travel insurance",
            "Voucher of the travel agency stating that the trip has been paid in full"
          ],
       "For Business": [
        "Letter from the employer stating the purpose of the trip to Bosnia and Herzegovina",
        "Letter of invitation from a company in Bosnia and Herzegovina, certified by the Ministry of Security of Bosnia and Herzegovina – Department for Foreign Citizens"
      ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}