{
    "Country": "Canada Visa",
    "Official_Name": "Canada Visa",
    "Country_Description": "<p><b>Canada</b>a North American country situated in northern and the western hemispheres by sharing its border with United Stated of America (Longest shared border in the world which is 8,893 km), North Pacific Ocean to the west, North Atlantic Ocean on the east, and the Arctic Ocean in the north. Canada is popular in its tourism and the famous Niagara Falls is a part of the country as well. The currency used is Canadian Dollar but many businesses will accept American currency as a courtesy to American tourists.</p>",
    "Additional_Description": "<br><h5>How to Apply for a Visa to the Canada from Dubai and Abu Dhabi</h5><p>A Canadian visit visa allows a person to enter Canada for the purpose of travel, business or to visit family and friends living in Canada.</p><br><h5>Required Documents for Canada Visa (Temporary Resident Visa – TRV)</h5><p>If you are applying for Canada tourist / visitor visa, please find the below list of documents required as supporting document.</p>",
    "Required_Documents": [
        "Your passport should be 06 month valid, and must contain 2 empty visa pages",
        "2 recent 35 x 45mm,white background matt finish,70-80 % face appearance",
        "UAE Resident visa copy (Minimum 03 months validity required)",
        "Original bank statement for the last 6 months with bank stamp",
        "NOC letter from employer stating the applicant’s employment status, position, length of contract and salary"
      ],
    "Supporting_Documents": {
        "": [
            "Documents showing that you own property or land, such as Property deed / mortgage statements/ accountant's letters / land registration",
            "Original and copy of marriage certificate with English translation",
            "Copy of birth certificate with English translation (Children less than 12 years old)"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}