{
    "Country": "Denmark Visa - Schengen",
    "Official_Name": "Denmark Visa - Schengen",
    "Country_Description": "<p><b>Denmark</b>is a Scandinavian country comprising the Jutland Peninsula and numerous islands. It's linked to nearby Sweden via the Oresund Bridge. Copenhagen, its capital, is home to royal palaces and colorful Nyhavn harbor, plus the Tivoli amusement park and the iconic “Little Mermaid” statue. Odense is writer Hans Christian Andersen’s hometown, with a medieval core of cobbled streets and half-timbered houses.</p>",
    "Required_Documents": [
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "The passport must be valid a minimum of six months after your intended departure from the territory of the Schengen States",
        "UAE residence visa should be valid for 03 months from the date of return from Schengen",
        "Original personal bank account statement for the last three months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "Sponsored family members (spouses, students etc.) have to enclose a copy of original birth and marriage certificate",
        "Receipt of application fee payment"
      ],
    "Supporting_Documents": {
        "": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc.)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance covering the entire territory of all Schengen member states with a minimum coverage of € 30.000",
            "A detailed daily program of your stay taking into consideration that if the applicant is travelling to Denmark and/or more than one Schengen country"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}