{
    "Country": "Germany Visa - Schengen",
    "Official_Name": "Germany Visa - Schengen",
    "Country_Description": "<p><b>Germany</b> is a country in Western Europe with a landscape of woods, rivers, mountain ranges, and beaches on the North Sea. Its history spans over two millennia. The Brandenburg Gate, as well as several WWII-related structures, may be found in Berlin, the country's capital.</p><br><p>It is located in Western and Central Europe, with Denmark bordering to the north, Poland and the Czech Republic to the east. It has Austria to the southeast, Switzerland to the south-southwest, France, Luxembourg and Belgium lie to the west, and the Netherlands to the northwest.</p>",
    "Required_Documents": [
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "The passport must be valid a minimum of six months after your intended departure from the territory of the Schengen States",
        "UAE residence permit must be valid for three months after the departure from the Schengen area",
        "Original personal bank account statement for the last three months signed and stamped by the bank",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)",
        "In case of dependents - copy of sponsor’s valid passport and UAE residence visa to be attached to letter from sponsor"
      ],
    "Supporting_Documents": {
        "For Tourism": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc.)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance covering the entire territory of all Schengen member states with a minimum coverage of € 30.000",
            "Sponsored family members (spouses, students etc.) have to enclose a copy of original birth and marriage certificate"
          ],
        "For Business": [
            "Copy of the valid trade license of the UAE company",
            "Invitation letter from company/authority in Germany"
          ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}