{
    "Country": "Ireland Visa",
    "Official_Name": "Ireland Visa",
    "Country_Description": "<p><b>Ireland</b> is one of the most popular tourism country in Western Europe with its natural greenish beauty and cliffs and caves, Dingle Peninsula, Castle like Blarney Castle, Dublin Castle, and national parks including Connemara National Park. Ireland is open for all tourist like budget traveler to luxury business people, accommodations are available from self-catering holiday home to five star luxury hotels & Caravan to historic houses.</p>",
    "Additional_Description": "<br><h5>How to Apply for a Visa to the Ireland from Dubai & Abu Dhabi</h5><p>If you are planning to visit Ireland, you might require a pre-arranged visa to enter the country. For all residents in United Arab Emirates can apply Ireland visa for the following categories.</p><ul class='feature-list'><li>Tourism</li><li> Visiting family and or friends</li><li> Business / Conference or Training </li></ul>",
    "Required_Documents": [
        "Recent passport photographs showing full face on a clear white background (35 mm X 45 mm)",
        "Passport must be valid for at least 6 months from the date you plan to leave Ireland",
        "UAE residence visa should be valid for 03 months from the date of return from Ireland",
        "Bank statements of your last six months",
        "NOC Letter from the company (should be mentioned designation, date of joining & salary paid)"
    ],
    "Supporting_Documents": {
        "For Tourism": [
            "Hotel booking reservation/s confirming duration of stay",
            "Travel itinerary such as airline bookings/tickets showing departure dates and destinations",
            "Travel & medical insurance"
        ],
        "For Visiting family and/or friends": [
            "Invitation letter from the host in Ireland",
            "If visiting family: Copy of passport and IRP card from reference in Ireland",
            "A covering letter outlining reason for your travel to Ireland"
        ],
        "For Business": [
            "Invitation letter from company in Ireland"
        ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}