{
    "Country": "Poland Visa - Schengen",
    "Official_Name": "Poland Visa - Schengen",
    "Country_Description": "<b>Sweden</b>Poland is a country in Central Europe bordered by Belarus, Czech Republic, Germany, Lithuania, Russia, Slovakia, and Ukraine. The geography of Poland is flat with mountains along the southern border. Poland is a member of the European Union (EU). Poland's capital and largest metropolis is Warsaw. It’s most famous and visited cities are Warsaw, the medieval town of Malbork, Lublin, Torun, Krakow and Poznan. Poland is also known for the Tatra National Park and the Bialowieza Forest. Figures show that most of the visitors are from Germany, followed by Britons and Russians.",
    "Required_Documents": [
        "Your passport valid for at least 6 months beyond the return date is required. Your passport must have at least two blank pages",
        "Recent color passport photograph (35–45mm in width), no more than 6-months old",
        "Copy of UAE Residence Visa valid at least 90 days from the intended return date",
        "Bank statements for the past three months or other verifiable evidence of sufficient means of subsistence during intended stay",
        "Original letter from employer stating employment status, position, length of contract, and salary"
    ],
    "Supporting_Documents": {
        "For Tourism": [
            "Proof of accommodation (i.e. valid and existing hotel booking, etc.)",
            "Proof of flight ticket booking or flight reservation including return",
            "International health insurance covering the entire territory of all Schengen member states with a minimum coverage of € 30.000",
            "A document to confirm the purpose and the conditions of your planned stay in Poland"
        ],
        "For Business": [
            "Invitation letter from a company or an authority to attend a meeting, conference or event "
        ]
    },
    "Fineway_Assistance": [
        "Detailed guidance with documentation that will reduce the chances of rejection",
        "Filing of Visa Application Form",
        "Make an appointment to submit your documents at the appropriate visa application center",
        "Making arrangements for flight and hotel booking (Only for visa purpose)",
        "One-to-one attention from a dedicated staff member who will guide you through the entire application procedure"
    ],
    "General_Conditions": [
        "Please reach 15 minutes prior to the appointment at the respective Visa Application Center",
        "Visa fees are nonrefundable in any cases once applied",
        "All the documents should be translated to English"
    ]
}